[
  {
    "id": 20251002,
    "date": "02/10/2025",
    "description": "Aplicar a regra de negócios criada na ultima aula dentro do formulário apropriado",
    "tasks": [
      {
        "id": 1,
        "text": "Abra o formulário de cadastro, entre no código (F7) e procure o método CadastrarUsuario.",
        "completed": false
      },
      {
        "id": 2,
        "text": "Na linha acima da criação do objeto userServicos, crie uma lista do tipo TextBox chamada camposParaValidar e inicie ela com todos os TextBox presentes no seu formulário de cadastro.",
        "completed": false
      },
      {
        "id": 3,
        "text": "Depois, crie um código para percorrer com o ForEach a fim de verificar todos os TextBox.",
        "completed": false
      },
      {
        "id": 4,
        "text": "Crie uma validação para ver se a propriedade Text de cada TextBox está Nula ou com Espaços em branco.",
        "completed": false
      },
      {
        "id": 5,
        "text": "Caso o programa identifique espaços em branco, você deverá mostrar uma mensagem na tela com as seguintes informações: Titulo - Erro de Validação, Texto - Ainda existem campos vazios que precisam ser preenchidos. Depois faça com que o campo sem informação seja focado com o método Focus() e retorne vazio.",
        "completed": false
      },
      {
        "id": 6,
        "text": "Faça uma verificação nos campos senha e confirmarSenha para ver se elas são iguais. Se forem diferentes, mostre uma mensagem para o usuário de que: As senhas digitadas não são iguais. Faça o programa focar no campo confirmarSenha e retorne vazio.",
        "completed": false
      },
      {
        "id": 7,
        "text": "Crie um novo objeto de Usuario (aquele que criamos em Modelos) chamado de novoUsuario e insira as informações dos TextBox nas propriedades do objeto.",
        "completed": false
      },
      {
        "id": 8,
        "text": "Na linha abaixo da criação do objeto userServicos, chame o método AdicionarUsuario e passe para ele o objeto novoUsuario.",
        "completed": false
      }
    ],
    "links": [
      {
        "title": "Criação de Listas no C#",
        "url": "https://learn.microsoft.com/pt-br/dotnet/csharp/tour-of-csharp/tutorials/list-collection"
      },
      {
        "title": "Como usar o ForEach",
        "url": "https://learn.microsoft.com/pt-br/dotnet/csharp/language-reference/statements/iteration-statements#the-foreach-statement"
      },
      {
        "title": "Exemplo de uso do string.IsNullOrWhiteSpace",
        "url": "https://learn.microsoft.com/pt-br/dotnet/api/system.string.isnullorwhitespace?view=net-9.0#exemplos"
      },
      {
        "title": "Comparações ordinárias padrão",
        "url": "https://learn.microsoft.com/pt-br/dotnet/csharp/how-to/compare-strings#default-ordinal-comparisons"
      },
      {
        "title": "Construtores de instância (guia de programação em C#)",
        "url": "https://learn.microsoft.com/pt-br/dotnet/csharp/programming-guide/classes-and-structs/instance-constructors"
      }
    ]
  }
]
